pellepl/baremetal/arch/msp/msp430/mdk/include/rf430f5155.h
/* TDxHINT Control Bits */
#define TDHFLIFG               (0x0001)       /* Timer0_D3 High-Res. fail low Interrupt Flag */
#define TDHFHIFG               (0x0002)       /* Timer0_D3 High-Res. fail high Interrupt Flag */
#define TDHLKIFG               (0x0004)       /* Timer0_D3 High-Res. frequency lock Interrupt Flag */
#define TDHUNLKIFG             (0x0008)       /* Timer0_D3 High-Res. frequency unlock Interrupt Flag */
#define TDHFLIE                (0x0100)       /* Timer0_D3 High-Res. fail low Interrupt Enable */
#define TDHFHIE                (0x0200)       /* Timer0_D3 High-Res. fail high Interrupt Enable */
#define TDHLKIE                (0x0400)       /* Timer0_D3 High-Res. frequency lock Interrupt Enable */
#define TDHUNLKIE              (0x0800)       /* Timer0_D3 High-Res. frequency unlock Interrupt Enable */

/* TD0IV Definitions */
#define TD0IV_NONE             (0x0000)       /* No Interrupt pending */
#define TD0IV_TDCCR1           (0x0002)       /* TD0CCR1_CCIFG */
#define TD0IV_TDCCR2           (0x0004)       /* TD0CCR2_CCIFG */
#define TD0IV_TDCCR3           (0x0006)       /* TD0CCR3_CCIFG */
#define TD0IV_TDCCR4           (0x0008)       /* TD0CCR4_CCIFG */
#define TD0IV_TDCCR5           (0x000A)       /* TD0CCR5_CCIFG */
#define TD0IV_TDCCR6           (0x000C)       /* TD0CCR6_CCIFG */
#define TD0IV_RES_14           (0x000E)       /* Reserverd */
#define TD0IV_TD0IFG           (0x0010)       /* TD0IFG */
#define TD0IV_TDHFLIFG         (0x0012)       /* TDHFLIFG Clock fail low */
#define TD0IV_TDHFHIFG         (0x0014)       /* TDHFLIFG Clock fail high */
#define TD0IV_TDHLKIFG         (0x0016)       /* TDHLKIE Clock lock*/
#define TD0IV_TDHUNLKIFG       (0x0018)       /* TDHUNLKIE Clock unlock */

/* Legacy Defines */
#define TD0IV_TD0CCR1          (0x0002)       /* TD0CCR1_CCIFG */
#define TD0IV_TD0CCR2          (0x0004)       /* TD0CCR2_CCIFG */
#define TD0IV_TD0CCR3          (0x0006)       /* TD0CCR3_CCIFG */
#define TD0IV_TD0CCR4          (0x0008)       /* TD0CCR4_CCIFG */
#define TD0IV_TD0CCR5          (0x000A)       /* TD0CCR5_CCIFG */
#define TD0IV_TD0CCR6          (0x000C)       /* TD0CCR6_CCIFG */


/************************************************************
* Timer1_D3
************************************************************/
#define __MSP430_HAS_T1D3__                   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_T1D3__ 0x0B40
#define TIMER_D1_BASE          __MSP430_BASEADDRESS_T1D3__

sfr_w(TD1CTL0);                               /* Timer1_D3 Control 0 */
sfr_w(TD1CTL1);                               /* Timer1_D3 Control 1 */
sfr_w(TD1CTL2);                               /* Timer1_D3 Control 2 */
sfr_w(TD1R);                                  /* Timer1_D3 Counter */
sfr_w(TD1CCTL0);                              /* Timer1_D3 Capture/Compare Control 0 */
sfr_w(TD1CCR0);                               /* Timer1_D3 Capture/Compare 0 */
sfr_w(TD1CL0);                                /* Timer1_D3 Capture/Compare Latch 0 */
sfr_w(TD1CCTL1);                              /* Timer1_D3 Capture/Compare Control 1 */
sfr_w(TD1CCR1);                               /* Timer1_D3 Capture/Compare 1 */
sfr_w(TD1CL1);                                /* Timer1_D3 Capture/Compare Latch 1 */
sfr_w(TD1CCTL2);                              /* Timer1_D3 Capture/Compare Control 2 */
sfr_w(TD1CCR2);                               /* Timer1_D3 Capture/Compare 2 */
sfr_w(TD1CL2);                                /* Timer1_D3 Capture/Compare Latch 2 */
sfr_w(TD1HCTL0);                              /* Timer1_D3 High-resolution Control Register 0 */
sfr_w(TD1HCTL1);                              /* Timer1_D3 High-resolution Control Register 1 */
sfr_w(TD1HINT);                               /* Timer1_D3 High-resolution Interrupt Register */
sfr_w(TD1IV);                                 /* Timer1_D3 Interrupt Vector Word */

/* Bits are already defined within the Timer0_Dx */

/* TD1IV Definitions */
#define TD1IV_NONE             (0x0000)       /* No Interrupt pending */
#define TD1IV_TDCCR1           (0x0002)       /* TD1CCR1_CCIFG */
#define TD1IV_TDCCR2           (0x0004)       /* TD1CCR2_CCIFG */
#define TD1IV_TDCCR3           (0x0006)       /* TD1CCR3_CCIFG */
#define TD1IV_TDCCR4           (0x0008)       /* TD1CCR4_CCIFG */
#define TD1IV_TDCCR5           (0x000A)       /* TD1CCR5_CCIFG */
#define TD1IV_TDCCR6           (0x000C)       /* TD1CCR6_CCIFG */
#define TD1IV_RES_14           (0x000E)       /* Reserverd */
#define TD1IV_TDIFG            (0x0010)       /* TD1IFG */
#define TD1IV_TDHFLIFG         (0x0012)       /* TDHFLIFG Clock fail low */
#define TD1IV_TDHFHIFG         (0x0014)       /* TDHFLIFG Clock fail high */
#define TD1IV_TDHLKIFG         (0x0016)       /* TDHLKIE Clock lock*/
#define TD1IV_TDHUNLKIFG       (0x0018)       /* TDHUNLKIE Clock unlock */

/* Legacy Defines */
#define TD1IV_TD1CCR1          (0x0002)       /* TD1CCR1_CCIFG */
#define TD1IV_TD1CCR2          (0x0004)       /* TD1CCR2_CCIFG */
#define TD1IV_TD1CCR3          (0x0006)       /* TD1CCR3_CCIFG */
#define TD1IV_TD1CCR4          (0x0008)       /* TD1CCR4_CCIFG */
#define TD1IV_TD1CCR5          (0x000A)       /* TD1CCR5_CCIFG */
#define TD1IV_TD1CCR6          (0x000C)       /* TD1CCR6_CCIFG */
#define TD1IV_TD1IFG           (0x0010)       /* TD1IFG */

/************************************************************
* Timer Event Control 0
************************************************************/
#define __MSP430_HAS_TEV0__                   /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_TEV0__ 0x0C00
#define TEC0_BASE              __MSP430_BASEADDRESS_TEV0__

sfr_w(TEC0XCTL0);                             /* Timer Event Control 0 External Control 0 */
sfr_b(TEC0XCTL0_L);                           /* Timer Event Control 0 External Control 0 */
sfr_b(TEC0XCTL0_H);                           /* Timer Event Control 0 External Control 0 */
sfr_w(TEC0XCTL1);                             /* Timer Event Control 0 External Control 1 */
sfr_b(TEC0XCTL1_L);                           /* Timer Event Control 0 External Control 1 */
sfr_b(TEC0XCTL1_H);                           /* Timer Event Control 0 External Control 1 */
sfr_w(TEC0XCTL2);                             /* Timer Event Control 0 External Control 2 */
sfr_b(TEC0XCTL2_L);                           /* Timer Event Control 0 External Control 2 */
sfr_b(TEC0XCTL2_H);                           /* Timer Event Control 0 External Control 2 */
sfr_w(TEC0STA);                               /* Timer Event Control 0 Status */
sfr_b(TEC0STA_L);                             /* Timer Event Control 0 Status */
sfr_b(TEC0STA_H);                             /* Timer Event Control 0 Status */
sfr_w(TEC0XINT);                              /* Timer Event Control 0 External Interrupt */
sfr_b(TEC0XINT_L);                            /* Timer Event Control 0 External Interrupt */
sfr_b(TEC0XINT_H);                            /* Timer Event Control 0 External Interrupt */
sfr_w(TEC0IV);                                /* Timer Event Control 0 Interrupt Vector */
sfr_b(TEC0IV_L);                              /* Timer Event Control 0 Interrupt Vector */
sfr_b(TEC0IV_H);                              /* Timer Event Control 0 Interrupt Vector */

/* TECxXCTL0 Control Bits */
#define TECXFLTHLD0            (0x0001)       /* TEV Ext. fault signal hold for CE0 */
#define TECXFLTHLD1            (0x0002)       /* TEV Ext. fault signal hold for CE1 */
#define TECXFLTHLD2            (0x0004)       /* TEV Ext. fault signal hold for CE2 */
#define TECXFLTHLD3            (0x0008)       /* TEV Ext. fault signal hold for CE3 */
#define TECXFLTHLD4            (0x0010)       /* TEV Ext. fault signal hold for CE4 */
#define TECXFLTHLD5            (0x0020)       /* TEV Ext. fault signal hold for CE5 */
#define TECXFLTHLD6            (0x0040)       /* TEV Ext. fault signal hold for CE6 */
#define TECXFLTEN0             (0x0100)       /* TEV Ext. fault signal enable for CE0 */
#define TECXFLTEN1             (0x0200)       /* TEV Ext. fault signal enable for CE1 */
#define TECXFLTEN2             (0x0400)       /* TEV Ext. fault signal enable for CE2 */
#define TECXFLTEN3             (0x0800)       /* TEV Ext. fault signal enable for CE3 */
#define TECXFLTEN4             (0x1000)       /* TEV Ext. fault signal enable for CE4 */
#define TECXFLTEN5             (0x2000)       /* TEV Ext. fault signal enable for CE5 */
#define TECXFLTEN6             (0x4000)       /* TEV Ext. fault signal enable for CE6 */

/* TECxXCTL0 Control Bits */
#define TECXFLTHLD0_L          (0x0001)       /* TEV Ext. fault signal hold for CE0 */
#define TECXFLTHLD1_L          (0x0002)       /* TEV Ext. fault signal hold for CE1 */
#define TECXFLTHLD2_L          (0x0004)       /* TEV Ext. fault signal hold for CE2 */
#define TECXFLTHLD3_L          (0x0008)       /* TEV Ext. fault signal hold for CE3 */
#define TECXFLTHLD4_L          (0x0010)       /* TEV Ext. fault signal hold for CE4 */
#define TECXFLTHLD5_L          (0x0020)       /* TEV Ext. fault signal hold for CE5 */
#define TECXFLTHLD6_L          (0x0040)       /* TEV Ext. fault signal hold for CE6 */

/* TECxXCTL0 Control Bits */
#define TECXFLTEN0_H           (0x0001)       /* TEV Ext. fault signal enable for CE0 */
#define TECXFLTEN1_H           (0x0002)       /* TEV Ext. fault signal enable for CE1 */
#define TECXFLTEN2_H           (0x0004)       /* TEV Ext. fault signal enable for CE2 */
#define TECXFLTEN3_H           (0x0008)       /* TEV Ext. fault signal enable for CE3 */
#define TECXFLTEN4_H           (0x0010)       /* TEV Ext. fault signal enable for CE4 */
#define TECXFLTEN5_H           (0x0020)       /* TEV Ext. fault signal enable for CE5 */
#define TECXFLTEN6_H           (0x0040)       /* TEV Ext. fault signal enable for CE6 */

/* TECxXCTL1 Control Bits */
#define TECXFLTPOL0            (0x0001)       /* TEV Polarity Bit of ext. fault 0 */
#define TECXFLTPOL1            (0x0002)       /* TEV Polarity Bit of ext. fault 1 */
#define TECXFLTPOL2            (0x0004)       /* TEV Polarity Bit of ext. fault 2 */
#define TECXFLTPOL3            (0x0008)       /* TEV Polarity Bit of ext. fault 3 */
#define TECXFLTPOL4            (0x0010)       /* TEV Polarity Bit of ext. fault 4 */
#define TECXFLTPOL5            (0x0020)       /* TEV Polarity Bit of ext. fault 5 */
#define TECXFLTPOL6            (0x0040)       /* TEV Polarity Bit of ext. fault 6 */
#define TECXFLTLVS0            (0x0100)       /* TEV Signal Type of Ext. fault 0 */
#define TECXFLTLVS1            (0x0200)       /* TEV Signal Type of Ext. fault 1 */
#define TECXFLTLVS2            (0x0400)       /* TEV Signal Type of Ext. fault 2 */
#define TECXFLTLVS3            (0x0800)       /* TEV Signal Type of Ext. fault 3 */
#define TECXFLTLVS4            (0x1000)       /* TEV Signal Type of Ext. fault 4 */
#define TECXFLTLVS5            (0x2000)       /* TEV Signal Type of Ext. fault 5 */
#define TECXFLTLVS6            (0x4000)       /* TEV Signal Type of Ext. fault 6 */

/* TECxXCTL1 Control Bits */
#define TECXFLTPOL0_L          (0x0001)       /* TEV Polarity Bit of ext. fault 0 */
#define TECXFLTPOL1_L          (0x0002)       /* TEV Polarity Bit of ext. fault 1 */
#define TECXFLTPOL2_L          (0x0004)       /* TEV Polarity Bit of ext. fault 2 */
#define TECXFLTPOL3_L          (0x0008)       /* TEV Polarity Bit of ext. fault 3 */
#define TECXFLTPOL4_L          (0x0010)       /* TEV Polarity Bit of ext. fault 4 */
#define TECXFLTPOL5_L          (0x0020)       /* TEV Polarity Bit of ext. fault 5 */
#define TECXFLTPOL6_L          (0x0040)       /* TEV Polarity Bit of ext. fault 6 */

/* TECxXCTL1 Control Bits */
#define TECXFLTLVS0_H          (0x0001)       /* TEV Signal Type of Ext. fault 0 */
#define TECXFLTLVS1_H          (0x0002)       /* TEV Signal Type of Ext. fault 1 */
#define TECXFLTLVS2_H          (0x0004)       /* TEV Signal Type of Ext. fault 2 */
#define TECXFLTLVS3_H          (0x0008)       /* TEV Signal Type of Ext. fault 3 */
#define TECXFLTLVS4_H          (0x0010)       /* TEV Signal Type of Ext. fault 4 */
#define TECXFLTLVS5_H          (0x0020)       /* TEV Signal Type of Ext. fault 5 */
#define TECXFLTLVS6_H          (0x0040)       /* TEV Signal Type of Ext. fault 6 */

/* TECxXCTL2 Control Bits */
#define TECCLKSEL0             (0x0001)       /* TEV Aux. Clock Select Bit: 0 */
#define TECCLKSEL1             (0x0002)       /* TEV Aux. Clock Select Bit: 1 */
#define TECAXCLREN             (0x0004)       /* TEV Auxilary clear signal control */
#define TECEXCLREN             (0x0008)       /* TEV Ext. clear signal control */
#define TECEXCLRHLD            (0x0010)       /* TEV External clear signal hold bit */
#define TECEXCLRPOL            (0x0020)       /* TEV Polarity Bit of ext. clear */
#define TECEXCLRLVS            (0x0040)       /* TEV Signal Type of Ext. clear */

/* TECxXCTL2 Control Bits */
#define TECCLKSEL0_L           (0x0001)       /* TEV Aux. Clock Select Bit: 0 */
#define TECCLKSEL1_L           (0x0002)       /* TEV Aux. Clock Select Bit: 1 */
#define TECAXCLREN_L           (0x0004)       /* TEV Auxilary clear signal control */
#define TECEXCLREN_L           (0x0008)       /* TEV Ext. clear signal control */
#define TECEXCLRHLD_L          (0x0010)       /* TEV External clear signal hold bit */
#define TECEXCLRPOL_L          (0x0020)       /* TEV Polarity Bit of ext. clear */
#define TECEXCLRLVS_L          (0x0040)       /* TEV Signal Type of Ext. clear */

#define TECCLKSEL_0            (0x0000)       /* TEV Aux. Clock Select: CLK0 */
#define TECCLKSEL_1            (0x0001)       /* TEV Aux. Clock Select: CLK1 */
#define TECCLKSEL_2            (0x0002)       /* TEV Aux. Clock Select: CLK2 */
#define TECCLKSEL_3            (0x0003)       /* TEV Aux. Clock Select: CLK3 */

/* TECxSTA Control Bits */
#define TECXFLT0STA            (0x0001)       /* TEV External fault status flag for CE0 */
#define TECXFLT1STA            (0x0002)       /* TEV External fault status flag for CE1 */
#define TECXFLT2STA            (0x0004)       /* TEV External fault status flag for CE2 */
#define TECXFLT3STA            (0x0008)       /* TEV External fault status flag for CE3 */
#define TECXFLT4STA            (0x0010)       /* TEV External fault status flag for CE4 */
#define TECXFLT5STA            (0x0020)       /* TEV External fault status flag for CE5 */
#define TECXFLT6STA            (0x0040)       /* TEV External fault status flag for CE6 */
#define TECXCLRSTA             (0x0100)       /* TEC External clear status flag */

/* TECxSTA Control Bits */
#define TECXFLT0STA_L          (0x0001)       /* TEV External fault status flag for CE0 */
#define TECXFLT1STA_L          (0x0002)       /* TEV External fault status flag for CE1 */
#define TECXFLT2STA_L          (0x0004)       /* TEV External fault status flag for CE2 */
#define TECXFLT3STA_L          (0x0008)       /* TEV External fault status flag for CE3 */
#define TECXFLT4STA_L          (0x0010)       /* TEV External fault status flag for CE4 */
#define TECXFLT5STA_L          (0x0020)       /* TEV External fault status flag for CE5 */
#define TECXFLT6STA_L          (0x0040)       /* TEV External fault status flag for CE6 */

/* TECxSTA Control Bits */
#define TECXCLRSTA_H           (0x0001)       /* TEC External clear status flag */

